import imgArrow from '../images/arrow.png';
import imgGift from '../images/gift.png';
import imgOk from '../images/ok.png';
import imgAnonce from '../images/anonce.png';

export const items = [
  {
    title: 'Приглашения<br>и бонусы',
    text: 'Мы знаем, что вы часто рекомендуете нас друзьям. Скоро мы сможем благодарить вас за это прозрачной система бонусов «SayHello Ambassador» с удобным личным кабинетом и наглядной статистикой.',
    icon: imgGift,
  },
  {
    title: 'Новые<br>направления',
    text: 'Мы не запускаем направления «для галочки». Каждый новый маршрут — это месяцы подготовки. В разработке Антарктика, Франция, Испания, Саудовская Аравия и кое‑что под грифом «секретно». Вы узнаете об этом первыми.',
    icon: imgArrow,
  },
  {
    title: 'Программа<br>лояльности',
    text: 'Привилегированная многоуровневая программа лояльности с накопительной системой и разными бонусами (от апгрейда номеров до мерча) в зависимости от количества путешествий нами.',
    icon: imgOk,
  },
  {
    title: 'Партнерские<br>предложения ',
    text: 'Мы ищем и лично отбираем тех, кто горит путешествиями так же, как мы. Скоро представим вам «SayHello Selection» – витрину авторских туров от партнеров, которые разделяют нашу философию: комфорт, сервис и любовь к деталям.',
    icon: imgAnonce,
  },
];
