<template>
  <q-page class="tw-container tw-grid tw-content-between">
    <div>
      <head-block title="Лицензионное соглашение" class="tw-mb-3" />
      <div
        class="tw-bg-white tw-rounded-[20px] tw-py-3 tw-px-4 -tw-mx-4 tw-font-medium"
        style="font-size: 14px; line-height: 18px"
      >
        Лицензионное соглашение на использование программы «Say Hello Travel»
        для мобильных устройств
        <br />
        <br />
        Перед использованием программы, пожалуйста, ознакомьтесь с условиями
        нижеследующего Лицензионного соглашения. Любое использование Вами
        программы «Say Hello Travel» означает полное и безоговорочное принятие
        Вами условий настоящего настоящего Лицензионного соглашения. Если Вы не
        принимаете условия настоящего Лицензионного соглашения в полном объёме,
        Вы не имеете права использовать программу «Say Hello Travel» в
        каких-либо целях. Настоящее Лицензионное соглашение вступает в силу с
        момента выражения Вами согласия с его условиями путем регистрации в
        программе «Say Hello Travel» и действует в течение неопределенного
        срока. 1. Общие положения 1.1. Настоящее Лицензионное соглашение
        устанавливает условия использования программы ЭВМ «Say Hello Travel» для
        мобильных устройств (далее по тексту Программа) любым дееспособным
        физическим лицом (далее по тексту Пользователь). 1.2. Правообладателем
        Программы является ООО «Энджой Тревел» ОГРН: 1170280080343, ИНН
        0274932990, почтовый адрес: Россия, 450015, Республика Башкортостан, г
        Уфа, ул. Бориса Домашникова, д. 22, кв. 140 (далее по тексту
        Правообладатель). 1.3. Копируя Программу, устанавливая её на свое
        мобильное устройство или используя Программу любым образом, Пользователь
        выражает свое полное и безоговорочное согласие со всеми условиями
        настоящего Лицензионного соглашения. 1.4. Использование Программы
        разрешается только на условиях настоящего Лицензионного соглашения. Если
        Пользователь не принимает условия настоящего Лицензионного соглашения в
        полном объёме, Пользователь не имеет права использовать Программу.
        Использование Программы с нарушением (невыполнением) какого-либо из
        условий настоящего Лицензионного соглашения запрещено. 1.5.
        Использование Программы Пользователем на условиях настоящего
        Лицензионного соглашения осуществляется безвозмездно. Использование
        Программы на условиях и способами, не предусмотренными настоящим
        Лицензионным соглашением, возможно только на основании отдельного
        соглашения с Правообладателем. 1.6. Если Пользователь полностью или в
        части не согласен с настоящим Лицензионным соглашением ему необходимо
        незамедлительно прекратить использование Программы и удалить её. 1.7.
        Использование Программы Пользователем означает безоговорочное принятие
        им всех условий настоящего Лицензионного соглашения, а также всех
        условий, размещенных в Приложении. 1.8. Программа предоставляет собой
        службу, назначением которой является накопление, обработка и передача
        поставщикам общественного питания заказов Пользователя на доставку
        товара. Правообладатель оставляет за собой право по собственному
        усмотрению добавлять, отменять или изменять некоторые или все из
        предлагаемых услуг в любое время. Отношения по доставке, заказанных
        через Программу товаров, возникают непосредственно между Пользователем и
        поставщиком. Обязательства по оплате товара поставщикам возникают
        непосредственно у Пользователя, а обязательства по передаче товара
        возникают непосредственно у поставщика. Правообладатель не несет
        ответственность за качество товаров поставщика и своевременность
        передачи товаров Пользователю. 2. Права на Программу 2.1. Программа
        содержит материалы, охраняемые авторским правом, товарные знаки и иные
        охраняемые законом материалы, включая, но не ограничиваясь: тексты,
        фотографии, графические изображения. 2.2. Единоличным владельцем
        Программы и документации, имеющей отношение к ней, является
        Правообладатель. Любые права на интеллектуальную собственность на
        Программу и относящиеся к ней, принадлежат Правообладателю на законных
        основаниях. Любые права на интеллектуальную собственность (включая,
        помимо прочего, авторское право, коммерческую тайну, торговые марки,
        патенты и т.п.), вытекающие из Программы, принадлежат Правообладателю на
        законных основаниях. 3. Пользование Программой (Лицензия) 3.1.
        Правообладатель предоставляет Пользователю, а Пользователь принимает
        персональную неисключительную некоммерческую ограниченную лицензию без
        права последующей передачи Программы третьим лицам. Правообладатель
        предоставляет Пользователю право использования Программы следующими
        способами: 3.1.1. Применять Программу по прямому функциональному
        назначению, в целях чего произвести её копирование и установку
        (воспроизведение) на мобильное(ые) устройство(ва) Пользователя.
        Пользователь вправе произвести установку Программы на неограниченное
        число мобильных устройств, принадлежащих Пользователю. 3.1.2.
        Безвозмездно распространять Программу в некоммерческих целях путем
        доведения о ней информации неопределенному кругу лиц без права
        последующей передачи. 3.2. Если в тексте настоящего Лицензионного
        соглашения специально не указано иное, Пользователь не можете без
        предварительного письменного согласия Правообладателя: использовать,
        модифицировать, встраивать в другое программное обеспечение или
        объединять с ним, создавать переработанную версию любой части Программы;
        продавать, передавать во временное пользование, переуступать, отдавать в
        залог или иным образом распоряжаться полученными правами на Программу,
        за исключением случаем предусмотренных настоящим Лицензионным
        соглашением; копировать, распространять или воспроизводить Программу, в
        том числе в интересах третьих лиц, за исключением случаем
        предусмотренных настоящим Лицензионным соглашением; обнародовать
        результаты какого-либо сопоставительного анализа в отношении Программы,
        использовать упомянутые результаты для конкурирующей деятельности по
        разработке программного обеспечения; модифицировать, дизассемблировать,
        декомпилировать, разбирать на составляющие коды, перерабатывать или
        усовершенствовать Программу, пытаться получить исходный текст Программы.
        3.3. Правообладатель не обязан предоставлять поддержку, обслуживание,
        обновления, модификации и новые версии Программы. Правообладатель может
        время от времени выпускать обновления для Программы и автоматически,
        путем электронной коммуникации, обновлять его версию, установленную на
        мобильном устройстве Пользователя. Пользователь, принимая настоящее
        Лицензионное соглашение дает согласие на такое автоматическое
        обновление, а также принимает то, что условия и положения настоящего
        Лицензионного соглашения будут иметь силу для указанных обновлений. 3.4.
        Право использования Программы после регистрации Пользователя является
        непередаваемым. Пользователь в полном объеме несет ответственность за
        действия по передаче Программы третьими лицами, а также за ущерб,
        нанесенный Программе и/или Правообладателю, причиненный третьими лицами
        в результате такой передачи. 3.5. Программа предоставляется без гарантии
        качества, не предполагает каких-либо гарантий, прямо выраженных или
        подразумеваемых. Правообладатель не гарантирует, что Программу будет
        соответствовать требованиям Пользователя, а также что её работа будет
        бесперебойной и безошибочной. Правообладатель не несет ответственности
        за точность, полноту, применимость или надежность результатов,
        полученных в ходе использования Программы или каких-либо данных и
        информации, загруженной либо иным способом полученной посредством
        использования Программы. Пользователь принимает на себя ответственность
        загружать, иным способом получать информацию через Программу на
        собственный риск и по собственному усмотрению, при этом к
        Правообладателя не могут быть предъявлены претензии относительно ущерба,
        полученного Пользователем или в отношении собственности Пользователя.
        3.6. Право на использование Программы в мобильном устройстве
        предоставленное на основании настоящего Лицензионного соглашения может
        быть в любой момент полностью аннулировано Правообладателем. 4. Особые
        условия 4.1. Использование Пользователем Программы возможно только при
        наличии доступа к сети Интернет. Пользователь самостоятельно получает и
        оплачивает такой доступ на условиях и по тарифам своего оператора связи
        или провайдера доступа к сети Интернет. 4.2. Программу может быть
        использовано Пользователями, достигшим 18 лет. Лица, моложе указанного
        возраста могут использовать Программу с согласия и под контролем своих
        законных представителей. Правообладатель может отказаться предоставлять
        свои услуги любым лицам и в любой момент по своему собственному
        усмотрению без объяснения причин. 4.3. Информация, предоставляемая
        Пользователем при использовании Программы, предоставляется поставщикам
        общественного питания. 4.4. Правообладатель не несет ответственности за
        содержание и, или актуальность информации, предоставляемой поставщиками,
        включая информацию о стоимости услуг, а также об их наличии в данный
        момент. 4.5. Взаимодействие Пользователя с поставщиками по вопросам
        приобретения услуг осуществляется Пользователем самостоятельно без
        участия Правообладателя. 4.6. При использовании Программы осуществляется
        обработка персональных данных Пользователя в соответствии с политикой по
        обработке персональных данных Правообладателя, размещенной на сайте в
        сети Интернет: https://www.sayhello.travel/ 4.7. Программа может
        собирать обезличенные (без привязки к персональным данным Пользователя)
        статистические данные об использовании Программы и в автоматическом
        режиме передавать их Правообладателю. 5. Ответственность 5.1. Программа
        предоставляется на условиях «как есть» (as is). Правообладатель не
        предоставляет никаких гарантий в отношении безошибочной и бесперебойной
        работы Программы или отдельных её компонентов и/или функций,
        соответствия Программы конкретным целям Пользователя, не гарантирует
        достоверность, точность, полноту и своевременность Данных, а также не
        предоставляет никаких иных гарантий, прямо не указанных в настоящем
        Лицензионном соглашении. 5.2. Правообладатель не несет ответственности
        вследствие правонарушения, а также в иных случаях, перед Пользователем
        или третьими лицами за любой ущерб или убытки (учитывая косвенные,
        фактические, последующие), включая, помимо прочего, какой-либо ущерб или
        убытки в отношении дохода от коммерческой деятельности, неполученной
        прибыли, деловой репутации, поврежденных или утраченных данных либо
        документации, понесенные тем или иным лицом вследствие или в связи с
        использованием Программы, даже если Правообладателя стало известно о
        возможности возникновения такого ущерба. 5.3. В соответствии с
        действующим законодательством, ответственность, которая может быть
        применена вследствие ненадлежащего оказания услуг, в том числе при
        предоставлении информации об услуге, предоставлении информации об
        исполнителе (поставщике), условиях оказания услуги, применяемых ценах, а
        также непосредственно оказании услуги, ее безопасности, выдачи
        документов строгой отчетности, причинение ущерба при оказании услуги,
        иных обязательств, несет исключительно поставщик. 5.4. В отдельных,
        специально оговоренных случаях Правообладатель может выступать в
        интересах и от имени поставщиков, если это предусмотрено при возможности
        оплаты услуг, либо иных услуг посредством использования банковских карт
        с использованием Программы. В иных случаях, где нет однозначного
        определения Правообладателя как уполномоченного представителя
        поставщиков, поставщики выступают самостоятельно, и Пользователь
        вступает в отношения непосредственно с поставщиками. 5.5.
        Правообладатель не несет ответственности за какие-либо прямые или
        косвенные последствия какого-либо использования или невозможности
        использования Программы (включая данные) и, или убытки, причиненные
        Пользователю и, или третьим сторонам в результате какого-либо
        использования, неиспользования или невозможности использования Программы
        (включая данные) или отдельных её компонентов и/или функций, в том числе
        из-за возможных ошибок или сбоев в их работе, за исключением случаев,
        прямо предусмотренных законодательством. 5.6. Правообладатель вправе
        прерывать работу Программы в целях оптимизации его работы, устранения
        проблем в работе Программы, настройки Программы, а также иных случаях по
        усмотрению Правообладателя. 5.7. Все вопросы и претензии, связанные с
        использованием/невозможностью использования Программы, а также возможным
        нарушением Программой законодательства и, или прав третьих лиц, должны
        направляться Правообладателю. 5.8. Все отношения, связанные с
        использованием Программы, регулируются законодательством Российской
        Федерации. 5.9. Принимая настоящее Лицензионное соглашение, Пользователь
        соглашаетесь с тем, что в случае признания судом Правообладателя
        виновником причинителя вреда, гражданско-правовая ответственность
        Правообладателя ограничивается максимальной выплатой в размере 5 000
        рублей. Пользователь уведомлен и ему известно, что Правообладатель
        обязуется выплатить только прямой ущерб и только на основании решения
        суда. Упущенная выгода возмещению не подлежит. 6. Согласие на получение
        информации и рекламы 6.1. При пользовании Программы Пользователь
        подтверждает, что является законным владельцем мобильного устройства, на
        которых установлено Программу, а также надлежаще зарегистрированным и
        законным пользователем услуг подвижной радиотелефонной связи или
        телематических услуг, позволяющих использовать возможности передачи
        данных для использования Программы и идентификации Пользователя. Также,
        Пользователь безусловно соглашаетесь на получение сервисных sms и push
        сообщений, необходимых для реализации функционала Программы. 6.2.
        Пользователь безусловно соглашается, что Правообладатель вправе
        информировать его о порядке и способах использования Программы, о
        проводимых поставщиками маркетинговых, рекламных и иных мероприятиях, об
        условиях приобретения и потребления услуг третьих лиц с использованием
        Программы, путем направления сообщений, в том числе содержащих рекламу,
        на мобильный телефон, компьютер или иное устройство, в том числе с
        использованием сети связи, любым доступным способом. Принятие условий
        настоящего Лицензионного соглашения означает безусловной согласие
        Пользователя с правом Правообладателя отправлять сообщения Пользователю.
        6.3. Пользователь соглашается получать от Правообладателя и
        сотрудничающих с ним поставщиков и иных лиц рекламные рассылки, а также,
        иную информацию о продуктах и услугах, в том числе, посредством
        телефонных звонков, e-mail и СМС-рассылок. 6.4. Используя Программу,
        Пользователь предоставляет Правообладателя право на совершение голосовых
        вызовов, а также даете согласие на получение от Правообладателя (или
        привлеченных им для указанной цели третьих лиц) SMS-сообщений на
        абонентский номер, указанный Пользователем при регистрации, а также
        номер электронной почты Пользователя в целях: повышения уровня
        безопасности использования Программы; информирования о новых продуктах,
        услугах и сервисах; направления сообщений рекламного и информационного
        характера, в том числе о товарах и услугах. 7. Конфиденциальность 7.1.
        Стороны обязуются принимать все необходимые меры для обеспечения защиты
        и безопасности информации и документов, обмен которыми осуществляется в
        Программе. 7.2. Пользователь обязуетесь самостоятельно принимать все
        необходимые меры по сохранению конфиденциальности, предотвращению
        несанкционированного использования Программы с устройства Пользователя и
        защите своих данных от несанкционированного доступа со стороны третьих
        лиц. Пользователь обязуетесь не сообщать свои данные третьим лицам, если
        такие данные касаются использования Программы. 7.3. Пользователь
        принимает на себя обязательство не осуществлять посредством Программы
        незаконные операции, незаконную торговлю и любые другие операции в
        нарушение законодательства Российской Федерации. 7.4. Правообладатель
        обязуется осуществлять надлежащий контроль по учету и хранению
        конфиденциальности персональных данных Пользователя. 8. Обновления 8.1
        Действие настоящей настоящего Лицензионного соглашения распространяется
        на все последующие обновления/ новые версии Программы. Соглашаясь с
        установкой обновления/ новой версии Программы, Пользователь принимает
        условия настоящей настоящего Лицензионного соглашения для
        соответствующих обновлений/новых версий Программы, если обновление/
        установка новой версии Программы не сопровождается иным лицензионным
        соглашением. 9. Иные положения 9.1 Правообладатель вправе в любое время
        без дополнительного адресного уведомления разрабатывать и вводить в
        действие дополнительные меры безопасности использования Программы. 9.2 В
        случае нарушения Пользователем настоящего Лицензионного соглашения или
        действующего законодательства Российской Федерации, Правообладатель
        вправе заблокировать доступ Пользователю к использованию Программы. 9.3
        Любые возникающие из настоящего Соглашения споры решаются путем
        переговоров между Сторонами. 9.4 В случае недостижения взаимного
        соглашения путем переговоров в течение 30 (тридцати) календарных дней с
        момента получения претензии одной из Сторон, все споры, разногласия или
        требования, возникающие из настоящего Соглашения или в связи с ним, в
        том числе касающиеся его исполнения, нарушения, прекращения или
        недействительности, подлежат разрешению в судебном порядке. 9.5
        Правообладатель вправе в одностороннем порядке вносить изменения в
        настоящее Лицензионное соглашение путем размещения нового текста,
        содержащего такие изменения. Изменения вступают в силу с момента такого
        размещения, если иной срок вступления изменений в силу не определен при
        публикации. В случае несогласия с изменением условий настоящего
        Лицензионного соглашения Пользователь вправе отказаться от его
        исполнения путем удаления Программы. 9.6 Устанавливая Программу,
        Пользователь гарантирует, что все условия настоящего Лицензионного
        соглашения им понятны, и Пользователь принимает условия без оговорок и в
        полном объеме, гарантирует, что не будет использовать Программу в иных
        целях, нежели указаны в тексте настоящего Лицензионного соглашения. 10.
        Реквизиты Правообладателя ООО «Энджой Тревел» Адрес место нахождения:
        450015, Республика Башкортостан, г Уфа, ул. Бориса Домашникова, д. 22,
        кв. 140 ИНН/КПП: 0274932990 / 027801001 ОГРН: 1170280080343
      </div>
    </div>
  </q-page>
</template>
<script lang="ts" setup>
import BaseIcon from 'src/components/core/BaseIcon.vue'
const deleteIs = ref(false)
const logoutIs = ref(false)
const supportIs = ref(false)
const logout = () => {
  authStore().logout()
}
</script>
<style lang="scss" scoped></style>
